Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
              = (known after apply)
      + description                    = "Convert input list of dictionaries to a TSV file."
      + filename                       = (known after apply)
      + function_name                  = "svep-backend-formatOutput"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                       = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + timeout                        = 24
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-formatOutput.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename" = "builds/6d6709ccef030a3aff6d4cec16be38f2ff98c5db2d0763b900f17f4012f55481.zip"
        }
    }

  # module.svep[0].module.lambda-getResultsURL.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-getResultsURL/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/348ff4a2ecd60bb7e13417127b9f468919debce7db6fb705c90305f673a7bf45.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/lambda/getResultsURL'"
          + "filename_new"   = "builds/348ff4a2ecd60bb7e13417127b9f468919debce7db6fb705c90305f673a7bf45.zip"
          + "filename_old"   = "builds/348ff4a2ecd60bb7e13417127b9f468919debce7db6fb705c90305f673a7bf45.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-getResultsURL"
        }
      + result  = (known after apply)
    }

  # module.svep[0].module.lambda-getResultsURL.aws_iam_policy.additional[0] will be created
  + resource "aws_iam_policy" "additional" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-getResultsURL"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-getResultsURL.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-getResultsURL-logs"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:438465168484:log-group:/aws/lambda/svep-backend-getResultsURL:*:*",
                          + "arn:aws:logs:*:438465168484:log-group:/aws/lambda/svep-backend-getResultsURL:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-getResultsURL.aws_iam_policy_attachment.additional[0] will be created
  + resource "aws_iam_policy_attachment" "additional" {
      + id         = (known after apply)
      + name       = "svep-backend-getResultsURL"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-getResultsURL",
        ]
    }

  # module.svep[0].module.lambda-getResultsURL.aws_iam_policy_attachment.logs[0] will be created
  + resource "aws_iam_policy_attachment" "logs" {
      + id         = (known after apply)
      + name       = "svep-backend-getResultsURL-logs"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-getResultsURL",
        ]
    }

  # module.svep[0].module.lambda-getResultsURL.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-getResultsURL"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-getResultsURL.aws_lambda_function.lambda[0] will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Returns the presigned results URL for results"
      + filename                       = (known after apply)
      + function_name                  = "svep-backend-getResultsURL"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1792
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                       = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + timeout                        = 28
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename" = "builds/348ff4a2ecd60bb7e13417127b9f468919debce7db6fb705c90305f673a7bf45.zip"
        }
    }

  # module.svep[0].module.lambda-initQuery.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-initQuery/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/6318eafa8fc786264ab8e7f44348c7e585840819ef254b1c861d09048cab6246.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/lambda/initQuery'"
          + "filename_new"   = "builds/6318eafa8fc786264ab8e7f44348c7e585840819ef254b1c861d09048cab6246.zip"
          + "filename_old"   = "builds/6318eafa8fc786264ab8e7f44348c7e585840819ef254b1c861d09048cab6246.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-initQuery"
        }
      + result  = (known after apply)
    }

  # module.svep[0].module.lambda-initQuery.aws_iam_policy.additional[0] will be created
  + resource "aws_iam_policy" "additional" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-initQuery"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-initQuery.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-initQuery-logs"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:438465168484:log-group:/aws/lambda/svep-backend-initQuery:*:*",
                          + "arn:aws:logs:*:438465168484:log-group:/aws/lambda/svep-backend-initQuery:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-initQuery.aws_iam_policy_attachment.additional[0] will be created
  + resource "aws_iam_policy_attachment" "additional" {
      + id         = (known after apply)
      + name       = "svep-backend-initQuery"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-initQuery",
        ]
    }

  # module.svep[0].module.lambda-initQuery.aws_iam_policy_attachment.logs[0] will be created
  + resource "aws_iam_policy_attachment" "logs" {
      + id         = (known after apply)
      + name       = "svep-backend-initQuery-logs"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-initQuery",
        ]
    }

  # module.svep[0].module.lambda-initQuery.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-initQuery"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-initQuery.aws_lambda_function.lambda[0] will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Invokes queryVCF with the calculated regions"
      + filename                       = (known after apply)
      + function_name                  = "svep-backend-initQuery"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1792
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                       = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + timeout                        = 28
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-initQuery.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename" = "builds/6318eafa8fc786264ab8e7f44348c7e585840819ef254b1c861d09048cab6246.zip"
        }
    }

  # module.svep[0].module.lambda-pluginClinvar.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-pluginClinvar/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/3eb90f13e13b17ff0a2c289c5b7054aed4f4228d00399290588afcea87c68692.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/lambda/pluginClinvar'"
          + "filename_new"   = "builds/3eb90f13e13b17ff0a2c289c5b7054aed4f4228d00399290588afcea87c68692.zip"
          + "filename_old"   = "builds/3eb90f13e13b17ff0a2c289c5b7054aed4f4228d00399290588afcea87c68692.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-pluginClinvar"
        }
      + result  = (known after apply)
    }

  # module.svep[0].module.lambda-pluginClinvar.aws_iam_policy.additional[0] will be created
  + resource "aws_iam_policy" "additional" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-pluginClinvar"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-pluginClinvar.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-pluginClinvar-logs"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:438465168484:log-group:/aws/lambda/svep-backend-pluginClinvar:*:*",
                          + "arn:aws:logs:*:438465168484:log-group:/aws/lambda/svep-backend-pluginClinvar:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-pluginClinvar.aws_iam_policy_attachment.additional[0] will be created
  + resource "aws_iam_policy_attachment" "additional" {
      + id         = (known after apply)
      + name       = "svep-backend-pluginClinvar"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-pluginClinvar",
        ]
    }

  # module.svep[0].module.lambda-pluginClinvar.aws_iam_policy_attachment.logs[0] will be created
  + resource "aws_iam_policy_attachment" "logs" {
      + id         = (known after apply)
      + name       = "svep-backend-pluginClinvar-logs"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-pluginClinvar",
        ]
    }

  # module.svep[0].module.lambda-pluginClinvar.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-pluginClinvar"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-pluginClinvar.aws_lambda_function.lambda[0] will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Add ClinVar annotations to sVEP result rows."
      + filename                       = (known after apply)
      + function_name                  = "svep-backend-pluginClinvar"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                       = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + timeout                        = 24
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename" = "builds/3eb90f13e13b17ff0a2c289c5b7054aed4f4228d00399290588afcea87c68692.zip"
        }
    }

  # module.svep[0].module.lambda-pluginConsequence.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.svep[0].module.lambda-pluginConsequence.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/svep-backend-pluginConsequence"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all          = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.svep[0].module.lambda-pluginConsequence.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-pluginConsequence"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-pluginConsequence.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-pluginConsequence-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-pluginConsequence"
    }

  # module.svep[0].module.lambda-pluginConsequence.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "svep-backend-pluginConsequence-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-pluginConsequence"
    }

  # module.svep[0].module.lambda-pluginConsequence.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Queries VCF for a specified variant."
      + function_name                  = "svep-backend-pluginConsequence"
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "uat"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "uat"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomad.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-pluginGnomad/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/9695eca273c3f1952134158b212096742626bd4fd9af05eee9ab381d2abe0c3c.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/lambda/pluginGnomad'"
          + "filename_new"   = "builds/9695eca273c3f1952134158b212096742626bd4fd9af05eee9ab381d2abe0c3c.zip"
          + "filename_old"   = "builds/9695eca273c3f1952134158b212096742626bd4fd9af05eee9ab381d2abe0c3c.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-pluginGnomad"
        }
      + result  = (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_iam_policy.additional[0] will be created
  + resource "aws_iam_policy" "additional" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-pluginGnomad"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-pluginGnomad-logs"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:438465168484:log-group:/aws/lambda/svep-backend-pluginGnomad:*:*",
                          + "arn:aws:logs:*:438465168484:log-group:/aws/lambda/svep-backend-pluginGnomad:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_iam_policy_attachment.additional[0] will be created
  + resource "aws_iam_policy_attachment" "additional" {
      + id         = (known after apply)
      + name       = "svep-backend-pluginGnomad"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-pluginGnomad",
        ]
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_iam_policy_attachment.logs[0] will be created
  + resource "aws_iam_policy_attachment" "logs" {
      + id         = (known after apply)
      + name       = "svep-backend-pluginGnomad-logs"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-pluginGnomad",
        ]
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-pluginGnomad"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_lambda_function.lambda[0] will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Add Gnomad annotations to sVEP result rows."
      + filename                       = (known after apply)
      + function_name                  = "svep-backend-pluginGnomad"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                       = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename" = "builds/9695eca273c3f1952134158b212096742626bd4fd9af05eee9ab381d2abe0c3c.zip"
        }
    }

  # module.svep[0].module.lambda-qcFigures.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.svep[0].module.lambda-qcFigures.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/svep-backend-qcFigures"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all          = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.svep[0].module.lambda-qcFigures.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-qcFigures"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-qcFigures.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-qcFigures-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-qcFigures"
    }

  # module.svep[0].module.lambda-qcFigures.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "svep-backend-qcFigures-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-qcFigures"
    }

  # module.svep[0].module.lambda-qcFigures.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Running vcfstats for generating graphic."
      + function_name                  = "svep-backend-qcFigures"
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 3000
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "uat"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "uat"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 10240
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-queryGTF.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-queryGTF/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/578165c317f7c01bd33503fe0dcefe3b736b30d73da1e8b027c00df8d899724a.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/lambda/queryGTF'"
          + "filename_new"   = "builds/578165c317f7c01bd33503fe0dcefe3b736b30d73da1e8b027c00df8d899724a.zip"
          + "filename_old"   = "builds/578165c317f7c01bd33503fe0dcefe3b736b30d73da1e8b027c00df8d899724a.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-queryGTF"
        }
      + result  = (known after apply)
    }

  # module.svep[0].module.lambda-queryGTF.aws_iam_policy.additional[0] will be created
  + resource "aws_iam_policy" "additional" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-queryGTF"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-queryGTF.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-queryGTF-logs"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:438465168484:log-group:/aws/lambda/svep-backend-queryGTF:*:*",
                          + "arn:aws:logs:*:438465168484:log-group:/aws/lambda/svep-backend-queryGTF:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-queryGTF.aws_iam_policy_attachment.additional[0] will be created
  + resource "aws_iam_policy_attachment" "additional" {
      + id         = (known after apply)
      + name       = "svep-backend-queryGTF"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-queryGTF",
        ]
    }

  # module.svep[0].module.lambda-queryGTF.aws_iam_policy_attachment.logs[0] will be created
  + resource "aws_iam_policy_attachment" "logs" {
      + id         = (known after apply)
      + name       = "svep-backend-queryGTF-logs"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-queryGTF",
        ]
    }

  # module.svep[0].module.lambda-queryGTF.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-queryGTF"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-queryGTF.aws_lambda_function.lambda[0] will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Queries GTF for a specified VCF regions."
      + filename                       = (known after apply)
      + function_name                  = "svep-backend-queryGTF"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                       = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + timeout                        = 24
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-queryGTF.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename" = "builds/578165c317f7c01bd33503fe0dcefe3b736b30d73da1e8b027c00df8d899724a.zip"
        }
    }

  # module.svep[0].module.lambda-queryVCF.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-queryVCF/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/731476854ca629ef91e08d1431189dae079603bc23960cc831b46d10fecc3dc1.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/lambda/queryVCF'"
          + "filename_new"   = "builds/731476854ca629ef91e08d1431189dae079603bc23960cc831b46d10fecc3dc1.zip"
          + "filename_old"   = "builds/731476854ca629ef91e08d1431189dae079603bc23960cc831b46d10fecc3dc1.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-queryVCF"
        }
      + result  = (known after apply)
    }

  # module.svep[0].module.lambda-queryVCF.aws_iam_policy.additional[0] will be created
  + resource "aws_iam_policy" "additional" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-queryVCF"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-queryVCF.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-queryVCF-logs"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:438465168484:log-group:/aws/lambda/svep-backend-queryVCF:*:*",
                          + "arn:aws:logs:*:438465168484:log-group:/aws/lambda/svep-backend-queryVCF:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-queryVCF.aws_iam_policy_attachment.additional[0] will be created
  + resource "aws_iam_policy_attachment" "additional" {
      + id         = (known after apply)
      + name       = "svep-backend-queryVCF"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-queryVCF",
        ]
    }

  # module.svep[0].module.lambda-queryVCF.aws_iam_policy_attachment.logs[0] will be created
  + resource "aws_iam_policy_attachment" "logs" {
      + id         = (known after apply)
      + name       = "svep-backend-queryVCF-logs"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-queryVCF",
        ]
    }

  # module.svep[0].module.lambda-queryVCF.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-queryVCF"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-queryVCF.aws_lambda_function.lambda[0] will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Invokes queryGTF for each region."
      + filename                       = (known after apply)
      + function_name                  = "svep-backend-queryVCF"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                       = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + timeout                        = 28
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-queryVCF.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename" = "builds/731476854ca629ef91e08d1431189dae079603bc23960cc831b46d10fecc3dc1.zip"
        }
    }

  # module.svep[0].module.lambda-queryVCFsubmit.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-queryVCFsubmit/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/4e51b58c352ee156ae72a587687bb67b259c4427541d678cbd8ec2e43c7c8cbf.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/lambda/queryVCFsubmit'"
          + "filename_new"   = "builds/4e51b58c352ee156ae72a587687bb67b259c4427541d678cbd8ec2e43c7c8cbf.zip"
          + "filename_old"   = "builds/4e51b58c352ee156ae72a587687bb67b259c4427541d678cbd8ec2e43c7c8cbf.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-queryVCFsubmit"
        }
      + result  = (known after apply)
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_iam_policy.additional[0] will be created
  + resource "aws_iam_policy" "additional" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-queryVCFsubmit"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-queryVCFsubmit-logs"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:438465168484:log-group:/aws/lambda/svep-backend-queryVCFsubmit:*:*",
                          + "arn:aws:logs:*:438465168484:log-group:/aws/lambda/svep-backend-queryVCFsubmit:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_iam_policy_attachment.additional[0] will be created
  + resource "aws_iam_policy_attachment" "additional" {
      + id         = (known after apply)
      + name       = "svep-backend-queryVCFsubmit"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-queryVCFsubmit",
        ]
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_iam_policy_attachment.logs[0] will be created
  + resource "aws_iam_policy_attachment" "logs" {
      + id         = (known after apply)
      + name       = "svep-backend-queryVCFsubmit-logs"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-queryVCFsubmit",
        ]
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-queryVCFsubmit"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_lambda_function.lambda[0] will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "This lambda will be called if there are too many batchids to be processed within"
      + filename                       = (known after apply)
      + function_name                  = "svep-backend-queryVCFsubmit"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn       
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.